Hello @artem-lifshits 
I dont see the parameters in my tfstate. 
The variable are set in my tfvars file. 
Yes my terraform want to recreate the nodepool

```hcl
module.cluster.opentelekomcloud_cce_node_pool_v3.node_pool["az01"] must be replaced
-/+ resource "opentelekomcloud_cce_node_pool_v3" "node_pool" {
      + availability_zone        = "eu-de-01" # forces replacement
      + flavor                   = "m4.4xlarge.8" # forces replacement
      ~ id                       = "ca0c13eb-a299-11f0-ac39-0255XXXXX03f" -> (known after apply)
      + initial_node_count       = 3
      ~ k8s_tags                 = {} -> (known after apply)
      + max_node_count           = 3
      ~ max_pods                 = 110 -> (known after apply)
      + min_node_count           = 3
        name                     = "ambersearch-cce-01-nodepool"
      + postinstall              = (known after apply)
      + preinstall               = (known after apply)
      + priority                 = 1
      ~ runtime                  = "containerd" -> (known after apply)
      + scale_down_cooldown_time = 30
      ~ scale_enable             = false -> true
      ~ security_group_ids       = [] -> (known after apply)
      + status                   = (known after apply)
      ~ subnet_id                = "df2daefb-ba8b-4458-ad10-d6XXXXXf" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ data_volumes {
          - extend_params = {} -> null
            # (4 unchanged attributes hidden)
        }

      ~ root_volume {
          - extend_params = {} -> null
            # (4 unchanged attributes hidden)
        }

      - timeouts {}
    }
```
      "module": "module.cluster",
      "mode": "managed",
      "type": "opentelekomcloud_cce_node_pool_v3",
      "name": "node_pool",
      "provider": "provider[\"registry.terraform.io/opentelekomcloud/opentelekomcloud\"]",
      "instances": [
        {
          "index_key": "az01",
          "schema_version": 0,
          "attributes": {
            "agency_name": null,
            "availability_zone": "",
            "cluster_id": "dbb9d114-a298-11f0-96d6-025XXXXXXXX40",
            "data_volumes": [
              {
                "extend_param": "",
                "extend_params": {},
                "kms_id": "d88e21c5-f151-4438-b9ba-9aXXXXXX947",
                "size": 100,
                "volumetype": "SSD"
              }
            ],
            "docker_base_size": null,
            "docker_lvm_config_override": null,
            "flavor": "",
......
```hcl

```